# AtLeastOneEquipmentOnDuty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..AtLeastOneEquipmentOnDuty Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
There should be at least one equipment on duty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AtLeastOneEquipmentOnDuty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AtLeastOneEquipmentOnDuty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AtLeastOneEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace